#language: ru
Функционал: Покупка электроники

Сценарий: 1 - Покупка смартфонов Apple

  Когда закрыт баннер с рекламой
  Когда выбран пункт меню - "Электроника"
  Когда выбрана категория товара - "Телефоны"
  Когда выбран бренд товара - "Apple"
  Когда заполнена цена от – "20000"
  Когда добавлены в корзину нечетные элементы из списка
  Тогда перешли в корзину
  Тогда проверено, что в корзине есть добавленный товар
  Тогда нажали кнопку удалить все
  Тогда проверили что - "Корзина пуста"

  Сценарий: 2 - Покупка зеркальных фотоаппаратов Nikon, Canon

    Когда закрыт баннер с рекламой
    Когда выбран пункт меню - "Электроника"
    Когда выбрана категория товара - "Зеркальные фотоаппараты"
    Когда выбран бренд товара - "Canon","Nikon"
    Когда заполнена цена от – "25000"
    Когда добавлены в корзину нечетные элементы из списка
    Тогда перешли в корзину
    Тогда проверено, что в корзине есть добавленный товар
    Тогда нажали кнопку удалить все
    Тогда проверили что - "Корзина пуста"